Revit 2027 API
MasonryCMU.MasonryCMUType Property
 The property labeled "Type" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MasonryCMUType { get; }
Public Shared ReadOnly Property MasonryCMUType As String
	Get
public:
static property String^ MasonryCMUType {
	String^ get ();
}
static member MasonryCMUType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUType".
See Also
Reference
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace